# Написать программу,которая проверят счастливость билетов

n = int(input('Введите шесть цифр номера билета: '))
sum1 = n % 10 + (n//10)%10 + (n//100)%10
m = n//1000
sum2 = m % 10 + (m//10)%10 + m//100
if (sum1 == sum2):
    print("yes")
else:
    print("no")    